<?php

namespace Database\Seeders;

use App\Models\Program;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProgramSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $programs = [
            [
                'name' => " برنامج بديل التدريب الشخصي 3 أيام",
                'features' => "هي خدمة رقمية حرصت على توفيرها لمن ال يستطيع االلتزام بقسط شهري للمدرب، أرفقت فيها أساسيات التدريب وجميع
                           المرفقات الالزمة للتدريب حتى يتمكن المتدرب من متابعة وتقييم تطوره. سيصلك ملف على قوقل شيت يحتوى على اآلتي:<br>
                           - كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية، يتضمن ٣ فصول منوعة مابين شروحات وأمثلة تطبيقيه )راجع
                           الفهرس لتفاصيل أكثر(.<br>
                           - برنامج رياضي قابل للتطبيق في المنزل أو النادي حسب إمكانياتك وأدواتك، مع بدائل لكل تمرين + شرح كتابي وفيديو
                           جانب كل تمرين + تحديد عدد الجوالت ونطاق التكرارات والشدة المطلوبة للبناء مع توضيح الحجم التدريبي الحالي للقدرة
                           على التعديل مستقبالً واالستمراربالتطور على نفس الجدول.<br>
                           - صفحة تشك ان لمتابعة التطور والنتائج أسبوعًيا لمدة ١٢ أسبوع )خانة لتسجيل الوزن يومًيا، الخطوات، القياسات، حاسبة
                           تلقائية للسعرات،ساعات النوم، صحة الهضم واالستشفاء وموعد الدورة الشهرية لإلناث(.<br>
                           - صفحة جدول حر لتصميم جدولك الرياضي الخاص بعد قراءة الكتاب في حال الرغبة بذلك.<br>
                           - مكتبة تمارين بداخل الجدول الختيار بدائل لكل تمرين",
                'price' => 299,
            ],
            [
                'name' => " برنامج بديل التدريب الشخصي 4 أيام",
                'features' => "هي خدمة رقمية حرصت على توفيرها لمن ال يستطيع االلتزام بقسط شهري للمدرب، أرفقت فيها أساسيات التدريب وجميع
                           المرفقات الالزمة للتدريب حتى يتمكن المتدرب من متابعة وتقييم تطوره. سيصلك ملف على قوقل شيت يحتوى على اآلتي:<br>
                           - كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية، يتضمن ٣ فصول منوعة مابين شروحات وأمثلة تطبيقيه )راجع
                           الفهرس لتفاصيل أكثر(.<br>
                           - برنامج رياضي قابل للتطبيق في المنزل أو النادي حسب إمكانياتك وأدواتك، مع بدائل لكل تمرين + شرح كتابي وفيديو
                           جانب كل تمرين + تحديد عدد الجوالت ونطاق التكرارات والشدة المطلوبة للبناء مع توضيح الحجم التدريبي الحالي للقدرة
                           على التعديل مستقبالً واالستمراربالتطور على نفس الجدول.<br>
                           - صفحة تشك ان لمتابعة التطور والنتائج أسبوعًيا لمدة ١٢ أسبوع )خانة لتسجيل الوزن يومًيا، الخطوات، القياسات، حاسبة
                           تلقائية للسعرات،ساعات النوم، صحة الهضم واالستشفاء وموعد الدورة الشهرية لإلناث(.<br>
                           - صفحة جدول حر لتصميم جدولك الرياضي الخاص بعد قراءة الكتاب في حال الرغبة بذلك.<br>
                           - مكتبة تمارين بداخل الجدول الختيار بدائل لكل تمرين",
                'price' => 299,
            ],
            [
                'name' => "برنامج بديل التدريب الشخصي 5 أايام",
                'features' => "هي خدمة رقمية حرصت على توفيرها لمن ال يستطيع االلتزام بقسط شهري للمدرب، أرفقت فيها أساسيات التدريب وجميع
                           المرفقات الالزمة للتدريب حتى يتمكن المتدرب من متابعة وتقييم تطوره. سيصلك ملف على قوقل شيت يحتوى على اآلتي:<br>
                           - كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية، يتضمن ٣ فصول منوعة مابين شروحات وأمثلة تطبيقيه )راجع
                           الفهرس لتفاصيل أكثر(.<br>
                           - برنامج رياضي قابل للتطبيق في المنزل أو النادي حسب إمكانياتك وأدواتك، مع بدائل لكل تمرين + شرح كتابي وفيديو
                           جانب كل تمرين + تحديد عدد الجوالت ونطاق التكرارات والشدة المطلوبة للبناء مع توضيح الحجم التدريبي الحالي للقدرة
                           على التعديل مستقبالً واالستمراربالتطور على نفس الجدول.<br>
                           - صفحة تشك ان لمتابعة التطور والنتائج أسبوعًيا لمدة ١٢ أسبوع )خانة لتسجيل الوزن يومًيا، الخطوات، القياسات، حاسبة
                           تلقائية للسعرات،ساعات النوم، صحة الهضم واالستشفاء وموعد الدورة الشهرية لإلناث(.<br>
                           - صفحة جدول حر لتصميم جدولك الرياضي الخاص بعد قراءة الكتاب في حال الرغبة بذلك.<br>
                           - مكتبة تمارين بداخل الجدول الختيار بدائل لكل تمرين",
                'price' => 299,
            ],
            [
                'name' => "كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية",
                'features' => "هي خدمة رقمية حرصت على توفيرها لمن ال يستطيع االلتزام بقسط شهري للمدرب، أرفقت فيها أساسيات التدريب وجميع المرفقات الالزمة للتدريب حتى يتمكن المتدرب من متابعة وتقييم تطوره. سيصلك ملف على قوقل شيت يحتوى على اآلتي:<br>
    - كتاب أساسيات التغذية والتمرين وصحة المرأة الرياضية، يتضمن ٣ فصول منوعة مابين شروحات وأمثلة تطبيقيه )راجع الفهرس لتفاصيل أكثر(.<br>
    - برنامج رياضي قابل للتطبيق في المنزل أو النادي حسب إمكانياتك وأدواتك، مع بدائل لكل تمرين + شرح كتابي وفيديو جانب كل تمرين + تحديد عدد الجوالت ونطاق التكرارات والشدة المطلوبة للبناء مع توضيح الحجم التدريبي الحالي للقدرة على التعديل مستقبالً واالستمراربالتطور على نفس الجدول.<br>
    - صفحة تشك ان لمتابعة التطور والنتائج أسبوعًيا لمدة ١٢ أسبوع )خانة لتسجيل الوزن يومًيا، الخطوات، القياسات، حاسبة تلقائية للسعرات،ساعات النوم، صحة الهضم واالستشفاء وموعد الدورة الشهرية لإلناث(.<br>
    - صفحة جدول حر لتصميم جدولك الرياضي الخاص بعد قراءة الكتاب في حال الرغبة بذلك.<br>
    - مكتبة تمارين بداخل الجدول الختيار بدائل لكل تمرين",
                'price' => 199,
            ],

        ];

        foreach ($programs as $program){
            Program::query()->create($program);
        }

    }
}
